# Задача 1. Да се напише програма, която проверява дали потребителят въвел годините си (age) е пълнолетен. 
# age = int(input("Моля, въведете вашата възраст: "))
# if age >= 18:
#     print("Вие сте пълнолетен.")
# else:
#     print("Вие не сте пълнолетен.")


# Задача 2. Да се напише програма, която проверява дали въведеното от потребителя число е четно или нечетно.
# number = int(input("Моля, въведете едно цяло число: "))
# if number % 2 == 0:
#     print("Числото е четно.")
# else:
#     print("Числото е нечетно.")

# Задача 3. Напишете програма включваща оператор "elif", която изкарва в конзолата крайна оценка, спрямо подадените от потребителя точки. Скала за оценяване: "Отличен 6" - 90 или повече, "Мн. Добър 5" - 80 или повече, "Добър 4" - 70 или повече, "Среден 3" - 60 или повече и "Слаб 2" под 60 точки.

# points = int(input("Моля, въведете вашите точки: "))
# if points >= 90:
#     print("Крайната ви оценка е: Отличен 6")
# elif points >= 80:
#     print("Крайната ви оценка е: Мн. Добър 5")
# elif points >= 70:
#     print("Крайната ви оценка е: Добър 4")
# elif points >= 60:
#     print("Крайната ви оценка е: Среден 3")
# else:
#     print("Крайната ви оценка е: Слаб 2")

# Задача 4. Да се напише програма, която извежда всички четни числа от 1 до 20.
# for num in range(1, 21):
#     if num % 2 == 0:
#         print(num)

# Задача 5. Напишете програма, която ще сумира всички числа от 1 до зададено от потребителя число n.
# n = int(input("Моля, въведете едно цяло число: "))
# total_sum = 0
# for i in range(1, n + 1):
#     total_sum += i
# print("Сумата на числата от 1 до", n, "е:", total_sum)

# Задача 6. Напишете програма, която генерира таблица за умножение с числата от 1 до 10.
# 
# for i in range(1, 11):
#     for j in range(1, 11):
#         print(f"{i} x {j} = {i * j}")


# Задача 7. Напишете програма, която намира всички делители на въведено от потребителя число.
# number = int(input("Моля, въведете едно цяло число: "))
# divisors = []
# for i in range(1, number + 1):
#     if number % i == 0:
#         divisors.append(i)
# print("Делителите на числото", number, "са:", divisors)

# Задача 8. Напишете програма, която да брои колко цифри има в дадено цяло число, въведено от потребителя. Програмата трябва да изведе броя на цифрите в числото.

# number = input("Моля, въведете едно цяло число: ")
# digit_count = len(number)
# print("Броят на цифрите в числото е:", digit_count)


# Задача 9. Създайте програма, която извежда четните числа и пропуска нечетните числа в диапазона от 2 до 20.
# for num in range(2, 21):
#     if num % 2 != 0:
#         continue
#     print(num)

# Задача 10. Направете програма, която намира първото нечетно число в интервал (start, end) въведен от потребителя и програмата спира, когато числото е намерено и изкарайте в конзолата съобщение: Първото нечетно число в интервала .. , .. е: ..
# start = int(input("Моля, въведете началото на интервала: "))
# end = int(input("Моля, въведете края на интервала: "))
# for num in range(start, end + 1):
#     if num % 2 != 0:
#         print(f"Първото нечетно число в интервала {start}, {end} е: {num}")
#         break


# Задача 11. Създайте програма с помощта на while цикъл, която извежда числата от 1 до 10, но пропуска числата, които са делители на 3 и спира изпълението, ако стигнем число, което е делител на 5.

# num = 1

# while num <= 10:

#     if num % 5 == 0:
#         print(f"Стигнахме {num} (делител на 5). Спираме.")
#         break 

#     if num % 3 == 0:
#         print(f"Пропускаме {num} (делител на 3)...")
#         num += 1     
#         continue     
#     print(num)
    
#     num += 1

# print("Цикълът приключи.")

# Задача 12. Направете програма, която намира всички комбинации от 3 различни числа в интервала от 1 до 9, чиято сума е 15.

# for i in range(1, 10):
#     for j in range(1, 10):
#         for k in range(1, 10):
#             if i != j and j != k and i != k:
#                 if i + j + k == 15:
#                     print(f"Комбинация: {i}, {j}, {k}")


# Задача 13. Направете програма, която симулира игра на "Камък, ножица, хартия" срещу компютъра. Потребителят въвежда свой избор, а компютъра генерира случаен избор.

# import random
# options = ['камък', 'ножица', 'хартия']

# while True:
#     user_choice = input(f"Изберете ({', '.join(options)}): ").lower().strip()

#     if user_choice in options:
#         break 
#     else:
#         print(f"Невалиден избор. Моля, изберете само 'камък', 'ножица' или 'хартия'.")

# computer_choice = random.choice(options)


# print(f"\nВие избрахте: {user_choice}")
# print(f"Компютърът избра: {computer_choice}\n")

# if user_choice == computer_choice:
#     print("Резултат: Равенство!")
# elif (user_choice == 'камък' and computer_choice == 'ножица') or \
#      (user_choice == 'ножица' and computer_choice == 'хартия') or \
#      (user_choice == 'хартия' and computer_choice == 'камък'):
#     print("Резултат: Вие печелите!")
# else:
#     print("Резултат: Компютърът печели!")  

 

# Задача 14. Напишете програма, която чете от конзолата списък с числа и след това изчислява и отпечатва средната стойност на числата.
# numbers = input("Моля, въведете списък с числа, разделени с интервал: ")
# number_list = [float(num) for num in numbers.split()]
# average = sum(number_list) / len(number_list)
# print("Средната стойност на числата е:", average)

# Задача 15. Напишете програма, която чете от конзолата списък с числа и след това премахва всички отрицателни числа от списъка.
    # numbers = input("Моля, въведете списък с числа, разделени с интервал: ")
    # number_list = [float(num) for num in numbers.split()]
    # positive_numbers = [num for num in number_list if num >= 0]
    # print("Списъкът без отрицателни числа е:", positive_numbers)

# Задача 16. Напишете програма, която чете от конзолата списък с числа и след това го сортира по низходящ ред.
# numbers = input("Моля, въведете списък с числа, разделени с интервал: ")
# number_list = [float(num) for num in numbers.split()]
# number_list.sort(reverse=True)
# print("Списъкът сортиран по низходящ ред е:", number_list)

# Задача 17.  Да се напише програма, която проверете дали въведената от потребителя година е високосна.
# year = int(input("Моля, въведете година: "))
# if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
#     print(f"Годината {year} е високосна.")
# else:
#     print(f"Годината {year} не е високосна.")

# Задача 18. Направете програма, която генерира пирамида от числа.

# Резултат:
#    1
#   121
#  12321
# 1234321


# print("   1")
# print("  121")
# print(" 12321")
# print("1234321")


# for i in range(1, 5): 
#     print(" " * (4 - i), end="")
    
#     for j in range(1, i + 1):
#         print(j, end="")
        
#     for k in range(i - 1, 0, -1):
#         print(k, end="")
        
#     print()


